batchsize_experiment/log/gpu_0.3_ttft_5000_tpot_50/client_batchsize460_20251112_053042.log
/root/miniconda3/envs/openrlhf/lib/python3.10/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 11-12 05:30:46 [__init__.py:216] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8011', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, no_stream=False, max_concurrency=460, model='/root/.cache/huggingface/hub/Qwen2.5-7B-Instruct', tokenizer=None, use_beam_search=False, num_prompts=460, logprobs=None, request_rate=inf, burstiness=1.0, seed=42, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=['ttft:5000', 'tpot:50'], custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=512, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=0.8, top_k=20, min_p=None, temperature=0.7, repetition_penalty=1.05, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, load_input_requests=None, save_input_requests=True)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf RPS.
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 460
100%|██████████| 460/460 [02:36<00:00,  2.95it/s]
============ Serving Benchmark Result ============
Successful requests:                     460       
Benchmark duration (s):                  156.13    
Total input tokens:                      235243    
Total generated tokens:                  471040    
Min_input_len:                           457.0     
Max_input_len:                           512.0     
Mean_input_len:                          511.3978260869565
P50_input_len:                           512.0     
P99_input_len:                           512.0     
Min_output_len:                          1024.0    
Max_output_len:                          1024.0    
Mean_output_len:                         1024.0    
P50_output_len:                          1024.0    
P99_output_len:                          1024.0    
Request throughput (req/s):              2.95      
Request goodput (req/s):                 0.79      
Output token goodput (tok/s):            806.71    
Total token goodput (tok/s):             1208.77   
Output token throughput (tok/s):         3016.95   
Total Token throughput (tok/s):          4523.65   
---------------Time to First Token----------------
Mean TTFT (ms):                          52319.80  
Median TTFT (ms):                        56675.72  
P99 TTFT (ms):                           118501.15 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.51     
Median TPOT (ms):                        32.10     
P99 TPOT (ms):                           70.77     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.51     
Median ITL (ms):                         21.64     
P99 ITL (ms):                            131.08    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          90688.08  
Median E2EL (ms):                        88504.49  
P99 E2EL (ms):                           155466.20 
==================================================